
start = """Ласкаво просимо до Бункера! Тут кожен хід – це стратегічний маневр, кожне слово – ключ до виживання. Чи готові ви до виклику апокаліпсису та словесної боротьби за виживання?

Зберіться з друзями та пограйте в картковий бункер, 
настільні ігри, днд та багато іншого в чаті Луна легенд!

Правила гри ви можете дізнатися, написавши команду /rules.

Для продовження будь ласка виберіть:"""


rules = """📝Правила

-Кожен гравець створює свого персонажа,використовуючи ключове слово "персона".

-Група вирішує,хто буде зачитувати інформацію,отриману в паролі передпочатком гри:"Історія" та "Бункер".

-Людина, яка зачитує цю інформацію,починає коло і визначає напрямокруху по колу.

-У кожному раунді гравці почерзі розкривають дві улюблені риси 
свого персонажа(окрім першого раунду,в якому кожен розкриває
 свою стать,рід занять та один з улюблених рентгенівських променів),з 
 обмеженням у дві хвилини,протягом яких вони можуть пояснити, 
 що саме вони розкрили,або що було розкрито раніше,Вони
 повинні довести свою важливість для банкіра.

-В кінці раунду гравці голосують за людину, яку потрібно викинути з кола.

-Карти дійне є рисамиі можуть бути використані в будь-який час протягом гри(якщо тільки гравець,який
 використав карту,не буде вигнаний з кола або не помре).

-Ваше завдання-залишитися в грі як умога довше.

-Гра закінчується,коли в колі залишається певна кількість людей.

Щасти тобі потрапити в бункер"""



proposition = """
Вітаю, ви зайшли у розділ  "Відгуки"

Тут ви можете залишити свої рекомендації щодо гри, запропонувати власні характеристики для персони або ж нову цікаву історію

Окрім цього Ви можете написати ваші враження від гри

Задля коректності не використовуйте подвійні лапки ( " ), надайте перевагу одинарним ( ' )
"""

thank = """
Дякуємо за ваш відгук!♥
Розробник обов'язково його перегляне
"""

